InformationRegisters/ТелеграмОбъектыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмОбъектыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧатПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмЧатыПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмОбъектыПользователей/Ext/ManagerModule.bsl
Процедура ЗаписатьНовыйОбъектПользователя(Бот, ЧатПользователь, ОбъектСсылка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмОбъектыПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЧатПользователь = ЧатПользователь;
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.ДатаЗагрузки = ТекущаяДата();
	МенеджерЗаписи.Ссылка = ОбъектСсылка;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры



Процедура ОбновитьСсылкуОбъектаПользователя(СтараяСсылка, НоваяСсылка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмОбъектыПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ссылка = СтараяСсылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Ссылка = НоваяСсылка;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры
